--------------------------------------------------------------------------------
-- Up
--------------------------------------------------------------------------------
-- 出于性能原因弃用throttle功能, 请改用Geyser微服务

DROP TABLE mq_throttle;

--------------------------------------------------------------------------------
-- Down
--------------------------------------------------------------------------------

CREATE TABLE mq_throttle (
  namespace        VARCHAR(255) NOT NULL UNIQUE
, cycle_start_time DATETIME     NOT NULL
, count            INTEGER      NOT NULL DEFAULT 0
);
